---
type: FabricationItemFile
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# FabricationItemFile

`Autodesk.Revit.DB.FabricationItemFile` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetImage | 2019 | `public virtual Bitmap GetImage ()` |
| Method | IsLoaded | 2019 | `public bool IsLoaded ()` |
| Method | IsValid | 2019 | `public bool IsValid ()` |
| Property | Identifier | 2019 | `public string Identifier { get ; }` |
| Property | IsUsed | 2019 | `public bool IsUsed { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |